package com.company;

class Task1 {
    static void tablePrint() {

        System.out.println("\nType transformation table\n");
        System.out.println("       |   byte   |   short   |   char   |   int   |   long   |   float   |   double   |   boolean");
        System.out.println("_______|__________|___________|__________|_________|__________|___________|____________|___________");
        System.out.println("byte   |    т     |     я     |     я    |    я    |    я     |     я     |     я      |     х     ");
        System.out.println("_______|__________|___________|__________|_________|__________|___________|____________|___________");
        System.out.println("short  |    ня    |     т     |     я    |    я    |    я     |     я     |     я      |     х     ");
        System.out.println("_______|__________|___________|__________|_________|__________|___________|____________|___________");
        System.out.println("char   |    я     |     я     |     т    |    я    |    я     |     я     |     я      |     х     ");
        System.out.println("_______|__________|___________|__________|_________|__________|___________|____________|___________");
        System.out.println("int    |    ня    |     ня    |     ня   |    т    |    я     |     я     |     я      |     х     ");
        System.out.println("_______|__________|___________|__________|_________|__________|___________|____________|___________");
        System.out.println("long   |    ня    |     ня    |     ня   |    ня   |    т     |     я     |     я      |     х     ");
        System.out.println("_______|__________|___________|__________|_________|__________|___________|____________|___________");
        System.out.println("float  |    ня    |     ня    |     ня   |    ня   |    ня    |     т     |     я      |     х     ");
        System.out.println("_______|__________|___________|__________|_________|__________|___________|____________|___________");
        System.out.println("double |    ня    |     ня    |     ня   |    ня   |    ня    |     ня    |     т      |     х     ");
        System.out.println("_______|__________|___________|__________|_________|__________|___________|____________|___________");
        System.out.println("boolean|    х     |     х     |     х    |    х    |    х     |     х     |     х      |     т     ");
        System.out.println("_______|__________|___________|__________|_________|__________|___________|____________|___________");
    }
}
